Autodesk.Revit.DB.ATFXMLImportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ATFXMLImportOptions.ExternalDataGUID
The GUID value associated with the import which
identifies the source model.
Since:
2022

Autodesk.Revit.DB.ATFXMLImportOptions.ApplicationId
The GUID value that represents an application ID.
If not specified, the default GUID value is used.
Since:
2022

Autodesk.Revit.DB.ATFXMLImportOptions.DefaultCategoryId
The default Category to be assigned to DirectShapes.
If not specified, Generic Model is used.
Since:
2022

Autodesk.Revit.DB.ATFXMLImportOptions.CreationMode
The criterion used to determine when to produce a DirectShape.
If not specified, one DirectShape for the entire import is used.
Since:
2022

Autodesk.Revit.DB.ATFXMLImportOptions.#ctor
Creates a new default set of options for ATF XML import.
Since:
2022

Autodesk.Revit.DB.ATFXMLImportOptions
The import options used to import ATF XML format files.
Since:
2022